dealer = {
    "city": "Самара",
    "where": "Самаре",
}
# Словарь соответствия цветов
model_mapping = {
    "GN8": {
        "folder": "gn8",
        "color": {
            "Черный": "black",
            "Синий": "blue",
            "Коричневый": "brown",
            "Белый": "white",
        }},
    "GS5": {
        "folder": "gs5",
        "color": {
            "Черный": "black",
            "Коричневый": "brown",
            "Серый": "gray",
            "Голубой": "ice-blue",
            "Серебристый": "silver",
            "Серебрянный": "silver",
            "Белый": "white",
        }},
    "GS8, I поколение": {
        "folder": "gs8",
        "color": {
            "Черный": "black",
            "Синий": "blue",
            "Коричневый": "brown",
            "Серый": "gray",
            "Голубой": "ice-blue",
            "Белый": "white",
        }},
    "GS8": {
        "folder": "gs8ii",
        "color": {
            "Черный": "black",
            "Серый": "gray",
            "Зеленый": "green",
            "Серебристый": "silver",
            "Серебрянный": "silver",
            "Белый": "white",
        }},
    "M8": {
        "folder": "m8",
        "color": {
            "Черный": "black",
            "Синий": "blue",
            "Зеленый": "green",
            "Золотой": "gold",
            "Белый": "white",
        }},
    # ... добавьте другие модели по мере необходимости
}